import { Container, Typography, List, ListItem } from "@mui/material";
import { ReactElement } from 'react';
import { config } from '@/lib/config';

export const MarketingFTTx = (): ReactElement => {
  return (
    <Container maxWidth="md">
      <Typography variant="h6" fontWeight={700} className="!mb-7">
        Маркетингова акція «Ціна – не новина»
      </Typography>

      <Typography variant="body1"  className="!mb-3">
        Учасники акції мають можливість замовити та підключити послугу
        «Оптичний Інтернет» (FTTH) (далі — Послуга) зі швидкістю до 1000 Мбіт/с.
        Користуватись Послугою за акційною ціною протягом 2-х років на наступних
        акційних умовах: <strong>з 1-го по 12 місяця — 99 грн/міс</strong>, з 13-го
        по 24 місяця — <strong>200 грн/міс</strong>, з 25-го місяця справлятиметься
        на регулярних умовах згідно обраного тарифного плану.
      </Typography>

      <Typography variant="body1" className="!mb-5">
        Учасники акції — нові абоненти Послуги, які не були абонентами Укртелекому
        попередні 90 днів послуги Інтернет.
      </Typography>

      <Typography variant="body1" fontWeight={700} className="!mb-3">
        Тарифні плани, доступні для підключення на умовах Акції:
      </Typography>

      <Typography variant="body1" className="!mb-5">
        «Активний 1 Гбіт/с», «Простий 1 Гбіт/с», «Класичний 1 Гбіт/с»,
        «Промо 1 Гбіт/с», «Вільний 1 Гбіт/с», «Вигідний 1000 Мбіт/с»,
        «Базовий 1 Гбіт/с», «Гігабітний Промо», «Оптимальний 1 Гбіт/с».
      </Typography>

      <Typography variant="body1" fontWeight={700} className="!mb-3">
        Параметри для тарифних планів зі швидкістю до 1000 Мбіт/с:
      </Typography>

      <Typography variant="body1" className="!mb-3">
        Максимальна швидкість передавання та приймання Інтернет до
        1 024 000 Кбіт/с, середня — 512 000 Кбіт/с, мінімальна — 64 Кбіт/с.
      </Typography>

      <Typography variant="body1" className="!mb-3">
        Учасник Акції не може скористатися іншими акційними та спеціальними
        пропозиціями, які передбачають зниження тарифу на користування послугами.
        Акція діє в обмеженій кількості населених пунктів.
      </Typography>

      <Typography variant="body1" className="!mb-3">
        Період проведення маркетингової акції — з 01.09.2024 до 31.12.2026.
      </Typography>

      <Typography variant="body1" className="!mb-3">
        Замовити послугу та отримати інформацію щодо умов акції можна за
        телефоном Контакт-центру:
        <br />
        <strong>{config.phone}</strong>
      </Typography>

      <Typography variant="body1" className="!mb-3">
        Вартість підключення залежить від технічної можливості й становить не
        менше, ніж акційна вартість підключення, що діє в населеному пункті.
      </Typography>

      <Typography variant="body1" className="!mb-3">
        Тарифи та ціни вказано у гривнях з ПДВ. Умови вказано станом на 01.01.2026.
      </Typography>

      <Typography variant="body1" className="!mb-3">
        Вартість тарифного плану не залежить від факту користування та
        фактичного обсягу споживання електронної комунікаційної послуги (обсягу
        отриманих і переданих даних).
      </Typography>

      <Typography variant="body1" className="!mb-5">
        Послуга Інтернет надається АТ «Укртелеком», бул. Тараса Шевченка, 18,
        м. Київ, 01601, за наявності технічної можливості.
      </Typography>

      <Typography variant="body1" fontWeight={700} className="!mb-3">
        Оренда обладнання:
      </Typography>

      <List sx={{ listStyleType: 'disc', pl: 4, py: 0 }}>
        <ListItem sx={{ display: 'list-item', p: 0, pb: 1 }}>
          оптичний термінал (ONU) — 1 грн/міс — за умови користування послугою
          з доступу до мережі Інтернет (за технологією FTTH).
        </ListItem>
        <ListItem sx={{ display: 'list-item', p: 0, pb: 1 }}>
          Маршрутизатор з функцією EasyMesh (з пропускною спроможністю
          WAN-порта до 1000 Мбіт/с) для доступу до мережі Інтернет (за
          технологією FTTH) абонент може:
          <List sx={{ listStyleType: 'circle', pl: 4, py: 0 }}>
            <ListItem sx={{ display: 'list-item', p: 0, pb: 0.5 }}>
              придбати за свій рахунок
            </ListItem>
            <ListItem sx={{ display: 'list-item', p: 0 }}>
              взяти в оренду на регулярних умовах
            </ListItem>
          </List>
        </ListItem>
      </List>

      <Typography variant="body1" className="!mb-3" sx={{ mt: 2 }}>
        Енергонезалежність послуги Інтернет забезпечується наявністю резервного
        живлення обладнання Інтернет-доступу Укртелеком під час відключень
        електроенергії. Тривалість резервного живлення обмежена і залежить від
        адреси підключення послуги. Абонентське обладнання, яке розташоване в
        приміщенні абонента (модем, роутер тощо), абонент має забезпечувати
        резервним живленням самостійно.
      </Typography>

      <Typography variant="body1" className="!mb-3">
        Ексклюзивна знижка 50% на перший місяць користування послугою хмарного
        геймінгу на платформі Boosteroid для діючих та нових користувачів
        (фізичних осіб) послуги Інтернет від АТ «Укртелеком». Послуги хмарного
        геймінгу надає ТОВ «Адвансед Клауд Технолоджіс». Оплата за послуги
        хмарного геймінгу здійснюється на рахунок ТОВ «Адвансед Клауд
        Технолоджіс». Промокод можна сформувати до 31.12.2026 року та
        використати тільки один раз. Умови користування та вартість послуги
        хмарного геймінгу вказані на сайті boosteroid.com.
      </Typography>

      <Typography variant="body1" className="!mb-3">
        «Квартира» — мається на увазі приміщення в житловому будинку, в якому
        розташовано одинадцять чи більше ізольованих помешкань, призначених та
        придатних для постійного проживання фізичних осіб. Виключно для цілей
        формування цін на послуги та тарифікації, а також для застосування
        категорій тарифів чи тарифних планів.
      </Typography>

      <Typography variant="body1">
        «Будинок» — мається на увазі житловий будинок, в якому розташовано
        десять чи менше ізольованих помешкань, призначених та придатних для
        постійного проживання фізичних осіб, а також будинки приватного
        сектора (індивідуальні житлові будинки). Виключно для цілей формування
        цін на послуги та тарифікації, а також для застосування категорій
        тарифів чи тарифних планів.
      </Typography>
    </Container>
  )
}
